{
  "fi": [   
    {
      "title": "Miten kurssille ilmoittaudutaan?",
      "text": [
        "Kurssille ei tarvitse varsinaisesti ilmoittautua ennen kuin haluat tehdä kurssin kokeen. Koe tehdään Avoimen yliopiston Moodle-järjestelmään. Katso lisää <a href='/osa0/yleista#arvosteluperusteet'>täältä</a>."
      ]
    },
    {
      "title": "Mikä on kurssin laajuus?",
      "text": [
        "Kurssin laajuus on <a href='/osa0/yleista#arvosteluperusteet'>riippuen tekemiesi tehtävien määrästä</a> 3-9 opintopistettä. Suoritettuasi kurssin voit jatkaa aihepiiriin syventymistä 1-10 opintopisteen laajuisen <a href='/osa0/yleista#full-stack-harjoitustyo'>Full stack -harjoitustyön</a> parissa."
      ]
    },    
    {
      "title": "Milloin on tehtävien ja kokeen deadline?",
      "text": [
        "Etenemisnopeus on vapaa, kurssilla on ainoastaan yksi deadline sekä tehtäville että kokeelle, 10.1.2021 klo 23.59.59. Kannattaa kuitenkin huomata, että kurssille on ilmoittauduttava viimeistään deadlinea edeltävänä päivänä 9.1.2021."
      ]
    },
    {
      "title": "Miten tehtävät palautetaan?",
      "text": [
        "Tehtävät palautetaan GitHubin kautta ja merkitsemällä tehdyt tehtävät palautussovellukseen, lue lisää <a href='/osa0/yleista#tehtavien-palauttaminen'>täältä</a>."
      ]
    },    
    {
      "title": "Pitääkö jokainen osa palauttaa omaan repositorioon?",
      "text": [
        "Ei. Voit käyttää yhtä tai useampaa repositoriota, tärkeintä on, että asiat repositorion sisällä ovat selkeästi nimettyjä."
      ]
    },
    {
      "title": "Voinko muokata tekemääni palautusta?",
      "text": [
        "Et. Kaikki osan tehtävät on palautettava kerralla. Jos merkkasit tehtäviä vahingossa väärin tai typotit repositorion nimen, lähetä mailia osoitteeseen matti.luukkainen@helsinki.fi"
      ]
    },
    {
      "title": "Milloin ja miten saan kurssilta suoritusmerkinnän?",
      "text": [
        "Saat suoritusmerkinnän sen jälkeen kun olet tehnyt hyväksyttävään suoritukseen oikeuttavan määrän tehtäviä, suorittanut kokeen hyväksytysti ja ilmoittanut palautussovelluksessa olevasi valmis kurssin suorituksen kanssa. Viimeinen mahdollinen suorituspäivä on 10.1.2021. Lue lisää <a href='/osa0/yleista#arvosteluperusteet'>täältä</a>."
      ]
    },  
    {
      "title": "Mikä kurssilla on muuttunut edellisestä vuodesta?",
      "text": [
        "Osiossa 0-4 on ainoastaan vähäisiä muutoksia. Osa 5d eli Cypress.io-kirjastolla tapahtuva <i>end to end -testaus</i> on suurelta osin uusi. Custom hookien käsittely on siirretty osasta 5 hieman laajennettuna osaan 7. <br><br>Reduxia käsittelevä osa 6 keskittyy ensisijaisesti reduxin uuteen hook-perustaiseen apiin. Myös osassa 7 käsiteltävä react-router on uudistunut käyttämään hook-apia. Vähäiselle ylläpidolle jäänyt Semantic UI React -kirjasto on korvattu MaterialUI-kirjastolla. <br><br>GraphQL:ää käsittelevä osa 8 on kokenut paljon päivityksiä erityisesti Apollo Clientin osalta, jonka hook-perustaiset apit ovat vihdoin stabiloituneet. TypeScriptiin keskittyvä osa 9 on kokonaan uusi. <br><br> Viime vuoden kurssimateriaali on nähtävissä osoitteessa <a href='https://fullstackopen-2019.github.io/'>https://fullstackopen-2019.github.io/</a>"
      ]
    },        
    {
      "title": "Voinko laajentaa aiempaa kurssisuoritustani?",
      "text": [
        "Voit, lue lisää <a href='/osa0/yleista#aiemmin-suoritetun-kurssin-taydentaminen'>täältä</a>"
      ]
    },
    {
      "title": "Kuulin että suorittamalla kurssin on mahdollista päästä työhaastatteluun",
      "text": [
        "Pitää paikkansa, jos suoritat täydellä laajuudella kurssin ja siihen liittyvän 10 op:n laajuisen harjoitustyön, pääset yhteistyökumppaniemme työhaastatteluun, lue lisää <a href='/osa0/yleista#haastattelulupaus'>täältä</a>."
      ]
    }
  ],
  "en": [
    {
      "title": "How do I sign up for the course?",
      "text": [
        "You don't have to sign up until you want to do the course exam. The exam is done in the Moodle-system of the Open University. You can find more information <a href='/en/part0/general_info#grading'>here</a>. Please note that only persons with Finnish social security number can take part in exams and get official ECTS credits. For the course certificate signup or Finnish social security number are not needed."
      ]
    },
    {
      "title": "How many credits is the course?",
      "text": [
        "The course is 3-9 ECTS credits <a href='/en/part0/general_info#grading'>depending on the amount of returned exercises</a>. After completing the course you can continue to deepen your knowledge on the subject matter by doing the 1-10 ETCS credit <a href='/en/part0/general_info#full-stack-project'>Full Stack project</a>. Please note that only persons with Finnish social security number can get official ECTS credits. For the course certificate signup or Finnish social security number are not needed."
      ]
    },
    {
      "title": "When is the deadline for the exercises and the exam?",
      "text": [
        "You can complete the course at your own pace. The course has only one deadline for the exercises and the exams 10th January 2021 at 23.59.59. Do keep in mind that you have to sign up for the exam no later than the day before the deadline 9.1.2021."
      ]
    },
    {
      "title": "How do I submit the exercises?",
      "text": [
        "The exercises are submitted to GitHub, and by marking the exercises as done in the exercise submission system. You can read more from <a href='/en/part0/general_info#submitting-exercises'>here</a>. "
      ]
    },
    {
      "title": "Do I have to submit each part to a separate repository?",
      "text": [
        "No. You can use one or more repositories, most important is to name everything in a repository clearly. "
      ]
    },
    {
      "title": "Can I edit a submission?",
      "text": [
        "No. All exercises for a part must be submitted at the same time. If you marked exercises wrong by accident, or wrote the repository name wrong, send an e-mail to matti.luukkainen@helsinki.fi."
      ]
    },
    {
      "title": "When and how can I get my credits?",
      "text": [
        "You can get your credits after submitting enough exercises for passing the course, passing the course exam and letting us know through the exercise submission system that you are ready with the course. The deadline is 10th January 2021. Read more <a href='/en/part0/general_info/#grading'>here</a>. Please note that only persons with Finnish social security number can get official ECTS credits. For the course certificate signup or Finnish social security number are not needed."
      ]
    },
    {
      "title": "Do I get a certificate after completing the course?",
      "text": [
        "Yes, certificate is available to all who pass the course by 10th January 2021. You can download the certificate after completing the course from the exercise submission system. For the course certificate signup to Open university and Finnish social security number are not needed."
      ]
    },    
    {
      "title": "Do I need a Finnish social security number to get the course certificate?",
      "text": [
        "For the course certificate Finnish social security number is not needed. You can download the certificate after completing the course from the exercise submission system."
      ]
    },
      {
      "title": "Should I signup to Open University to get the course certificate?",
      "text": [
        "For the course certificate signup to Open University is not needed. You can download the certificate after completing the course from the exercise submission system."
      ]
    },
    {
      "title": "What has changed since the last year?",
      "text": [
        "There are only minor changes to parts 0-4. Part 5d, <i>end to end -testing</i> using the Cypress.io- library is almost completely new material.  Using custom hooks has been moved from part 5 to part 7 with some new content. <br><br> Part 6, which is about Redux, concentrates on the new, hook-based, redux api. The material on react-router in part 7 has also been updated to use the hook-api. Semantic UI React has been replaced with the MaterialUI library due to lack of maintenance. <br><br> Part 8 on GraphQL has major updates especially on Apollo Client, which finally has stable hook based apis. Part 9 on TypeScript is completely new. <br><br> Last year's course material can be found from <a href='https://fullstackopen-2019.github.io/'>https://fullstackopen-2019.github.io/</a>."
      ]
    },        
    {
      "title": "I started the course last year, how should I continue?",
      "text": [
        "Read more from <a href='/en/part0/general_info#expanding-a-previously-completed-course'>here</a>"
      ]
    },    
    {
      "title": "I heard that I could get a job interview by completing the course.",
      "text": [
        "That's right. If you complete the course with full credits, and complete the practical work with 10 credits, you get a job interview with our partners. Read more <a href='/en/part0/general_info#interview-promise'>here</a>. Please note that only persons with Finnish social security number can get take part to exam and get official ECTS credits."
      ]
    }
  ],
  "zh": [
    {
      "title": "我如何报名这门课程呢？",
      "text": [
        "除非你想参加课程考试，否则你并不必报名。 考试是在开放大学的 Moodle 系统中完成的。 在<a href='/zh/part0/general_info#grading'>这里</a>.你可以找到更多资料。请注意，只有拥有芬兰社保账号的人才能参加考试并获得官方的 ECTS 学分。 而对于课程证书，不需要报名或芬兰社保号码。"
      ]
    },
    {
      "title": "这门课多少学分呢？",
      "text": [
        "该课程为3-9个ECTS学分，这<a href='/zh/part0/general_info#grading'>取决于您提交的练习次数</a>。 完成课程后，您可以通过进行<a href='/zh/part0/general_info#full-stack-project'> Full Stack项目</a>来加深对课程内容的了解，从而获得1-10 ETCS学分。 请注意，只有具有芬兰社保号码的人才能获得ECTS官方积分。 对于课程证书，不需要注册或芬兰社保号码。"
      ]
    },
    {
      "title": "练习与考试的截止日期是什么时候呢？",
      "text": [
        "您可以按照自己的进度完成课程。 该课程的练习和考试只有一个截止日期，即2021年1月10日的23点59分59秒。 请记住，您必须在截止日期的前一天，即2020年1月9日报名参加考试。"
      ]
    },
    {
      "title": "我如何提交练习作业呢？",
      "text": [
        "练习将提交到GitHub，并在练习提交系统中将练习标记为完成。 您可以从<a href='/zh/part0/general_info#submitting-exercises'>这里</a>阅读更多相关内容。"
      ]
    },
    {
      "title": "我需要为每次提交都创建一个代码仓库吗？",
      "text": [
        "不需要。您可以使用一个或多个代码仓库，最重要的是清楚地描述仓库中的所有内容。"
      ]
    },
    {
      "title": "我能重新编辑我的提交吗？",
      "text": [
        "不可以。每部分的所有练习必须一起提交。如果你不小心将练习提交错了，或者把仓库名字写错了，给 matti.luukkainen@helsinki.fi 这个邮箱发送一个说明。"
      ]
    },
    {
      "title": "我什么时候，以及如何获得自己的学分呢？",
      "text": [
        "当你提交足够的练习，达到课程通过标准后，通过了课程考试，并通过练习提交系统告知我们所有准备已经妥当，才能获得学分。 截止日期是2020年1月10日。在<a href='/zh/part0/general_info/#grading'>此处</a>了解更多信息。 请注意，只有具有芬兰社保号码的人才能获得ECTS官方积分。 对于课程证书，不需要注册或芬兰社保号码。"
      ]
    },
    {
      "title": "在我完成这门课程后能够获得结业证书吗？",
      "text": [
        "是的，所有在2021年1月10日之前通过课程的人都可获得证书。您可以从练习提交系统中完成课程后下载证书。 对于课程证书，不需要注册公开大学和芬兰的社保号码。"
      ]
    },    
    {
      "title": "为了获得课程的结业证书，我需要芬兰的社保号码吗？",
      "text": [
        "对于课程结业证书来说，不需要芬兰社保号码。 完成课程后，您可以从练习提交系统下载证书。"
      ]
    },
    {
      "title": "为了获得课程的结业证书，我需要注册公开大学吗？",
      "text": [
        "对于课程结业证书来说，不需要注册公开大学。 完成课程后，您可以从练习提交系统下载证书。"
      ]
    },
    {
      "title": "这门课与去年的内容有什么不同？",
      "text": [
        "对于0~4章节，只有一些很小的改动。第5d章节，<i>端到端测试</i> 利用了Cypress.io 这个库，这几乎是全新的内容。使用自定义钩子（custom hook）的内容已经从第5章节转移到了第7章节，并添加了一些新的内容。 <br><br> 第6章是讲Redux的，主要介绍了新的基于hook的redux API。第7章的react-router 也更新为使用hook-api。由于Semantic UI React 缺乏维护，其内容已经被替换为了 MaterialUI library 的内容。<br><br> 第8章 GraphQL有了较大版本的升级，尤其引入了Apollo Client，它终于有了稳定的基于hook的api。第9章是全新的内容。<br><br> 去年的课程内容可以通过<a href='https://fullstackopen-2019.github.io/'>https://fullstackopen-2019.github.io/</a>进行访问。"
      ]
    },
    {
      "title": "我是从去年的课程开始学习的，我应该怎么续接今年的课程呢？",
      "text": [
        "阅读更多 <a href='/zh/part0/general_info#expanding-a-previously-completed-course'>这一章节</a>的内容。"
      ]
    }
  ]
}
