{
  "fi": [
    {
      "title": "Miten kurssille ilmoittaudutaan?",
      "text": [
        "Kurssille ei tarvitse varsinaisesti ilmoittautua ennen kuin haluat tehdä kurssin kokeen. Koe tehdään Avoimen yliopiston Moodle-järjestelmään. Katso lisää <a href='/osa0/yleista#arvosteluperusteet'>täältä</a>."
      ]
    },
    {
      "title": "Mikä on kurssin laajuus?",
      "text": [
        "Kurssin laajuus on <a href='osa0/yleista#arvosteluperusteet'>riippuen tekemiesi tehtävien määrästä</a>  3-8 opintopistettä. Suoritettuasi kurssin voit jatkaa aihepiiriin syventymistä 1-10 opintopisteen laajuisessa <a href='/osa0/yleista#full-stack-harjoitustyo'>Full stack -harjoitustyön</a> parissa."
      ]
    },
    {
      "title": "Milloin on tehtävien ja kokeen deadline?",
      "text": [
        "Etenemisnopeus on vapaa, kurssilla on ainoastaan yksi deadline sekä tehtäville että kokeelle 10.1.2020 klo 23.59.59. Kannattaa kuitenkin huomata, että kurssille on ilmoittauduttava viimeistään deadliea edeltävänä päivänä 9.1.2020."
      ]
    },
    {
      "title": "Miten tehtävät palautetaan?",
      "text": [
        "Tehtävät palautetaan GitHubin kautta ja merkitsemällä tehdyt tehtävät palautussovellukseen, lue lisää <a href='/osa0/yleista#tehtavien-palauttaminen'>täältä</a>."
      ]
    },
    {
      "title": "Pitääkö jokainen osa palauttaa omaan repositorioon?",
      "text": [
        "Ei. Voit käyttää yhtä tai useampaa repositoriota, tärkeintä että asiat repositorion sisällä ovat selkeästi nimettyjä."
      ]
    },
    {
      "title": "Voinko muokata tekemääni palautusta?",
      "text": [
        "Et. Kaikki osan tehtävät on palautettava kerralla. Jos merkkasit tehtäviä vahingossa väärin tai typotit repositorion nimen, lähetä mailia osoitteeseen matti.luukkainen@helsinki.fi"
      ]
    },
    {
      "title": "Milloin ja miten saan kurssilta suoritusmerkinnän?",
      "text": [
        "Saat suoritusmerkinnän sen jälkeen kun olet tehnyt hyväksyttävään suositukseen oikeuttavan määrän tehtäviä, suorittanut kokeen hyväksytysti ja ilmoittanut palautussovelluksessa olevasi valmis kurssin suorituksen kanssa. Viimeinen mahdollinen suorituspäivä on 10.1.2020. Lue lisää <a href='/osa0/yleista#arvosteluperusteet'>täältä</a>."
      ]
    },
    {
      "title": "Voinko laajentaa aiempaa kurssisuoritustani?",
      "text": [
        "Voit, lue lisää <a href='/osa0/yleista#aiemmin-suoritetun-kurssin-taydentaminen'>täältä</a>"
      ]
    },
    {
      "title": "Suoritin kurssin viime vuonna. Miten opin käyttämään React hookeja?",
      "text": [
        "State hookia, eli tapaa määritellä tila funktionaalisille komponenteille käsitellään <a href='/osa1/komponentin_tila_ja_tapahtumankasittely/#tilallinen-komponentti'>osassa 1</a>. Lifecycle-metodien roolia hoitavia effect hookeja käsitellään <a href='/osa2/palvelimella_olevan_datan_hakeminen#effect-hookit'>osassa 2</a>. Custom hookeista puhutaan <a href='/osa5/custom_hookit'>osassa 5</a>"
      ]
    },
    {
      "title": "Kuulin että suorittamalla kurssin on mahdollista päästä työhaastatteluun",
      "text": [
        "Pitää paikkansa, jos suoritat täydellä laajuudella kurssin ja siihen liittyvän 10 op:n laajuisen harjoitustyön, pääset yhteistyökumppaniemme työhaastatteluun, lue lisää <a href='/osa0/yleista#haastattelulupaus'>täältä</a>."
      ]
    }
  ],
  "en": [
    {
      "title": "How do I sign up for the course?",
      "text": [
        "You don't have to sign up until you want to do the course exam. The exam is done to the Moodle-system of the Open University. You can find more information <a href='/en/part0/general_info#grading'>here</a>. Please note that only persons with Finnish social security number can get take part to exam and get official ECTS credits. For the course certificate signup or Finnish social security number are not needed."
      ]
    },
    {
      "title": "How many credits is the course?",
      "text": [
        "The course is 3-8 ECTS credits <a href='/en/part0/general_info#grading'>depending on the amount of returned exercises</a>. After completing the course you can continue to deepen your knowledge on the subject matter by doing the 1-10 ETCS credit <a href='/en/part0/general_info#full-stack-project'>Full Stack project</a>. Please note that only persons with Finnish social security number can get official ECTS credits. For the course certificate signup or Finnish social security number are not needed."
      ]
    },
    {
      "title": "When is the deadline for the exercises and the exam?",
      "text": [
        "You can complete the course at your own pace. The course has only one deadline for the exercises and the exams 10th January 2020 at 23.59.59. Do keep in mind that you have to sign up for the exam no later than the day before the deadline 9.1.2020."
      ]
    },
    {
      "title": "How do I submit the exercises?",
      "text": [
        "The exercises are submitted to GitHub, and by marking the exercises as done in the exercise submission system. You can read more from <a href='/en/part0/general_info#submitting-exercises'>here</a>. "
      ]
    },
    {
      "title": "Do I have to submit each part to a separate repository?",
      "text": [
        "No. You can use one or more repositories, most important is to name everything in a repository clearly. "
      ]
    },
    {
      "title": "Can I edit a submission?",
      "text": [
        "No. All exercises for a part must be submitted at the same time. If you marked exercises wrong by accident, or wrote the repository name wrong, send an e-mail to matti.luukkainen@helsinki.fi."
      ]
    },
    {
      "title": "When and how can I get my credits?",
      "text": [
        "You can get your credits after submitting enough exercises for passing the course, passing the course exam and letting us know through the exercise submission system that you are ready with the course. The deadline is 10th January 2020. Read more <a href='/en/part0/general_info/#grading'>here</a>. Please note that only persons with Finnish social security number can get official ECTS credits. For the course certificate signup or Finnish social security number are not needed."
      ]
    },
    {
      "title": "Do I get a certificate after completing the course?",
      "text": [
        "Yes, certificate is available to all who pass the course by 10th January 2020. You can download the certificate after completing the course from the exercise submission system. For the course certificate signup to Open university and Finnish social security number are not needed."
      ]
    },    
    {
      "title": "Do I need a Finnish social security number to get the course certificate?",
      "text": [
        "For the course certificate Finnish social security number is not needed. You can download the certificate after completing the course from the exercise submission system."
      ]
    },
      {
      "title": "Should I signup to Open University to get the course certificate?",
      "text": [
        "For the course certificate signup to Open University is not needed. You can download the certificate after completing the course from the exercise submission system."
      ]
    },
    {
      "title": "I heard that I could get a job interview by completing the course.",
      "text": [
        "That's right. If you complete the course with full credits, and complete the practical work with 10 credits, you get a job interview with our partners. Read more <a href='/en/part0/general_info#interview-promise'>here</a>. Please note that only persons with Finnish social security number can get take part to exam and get official ECTS credits."
      ]
    }
  ]
}
