{
  "fi": {
    "mainTitle": "Syväsukellus moderniin websovelluskehitykseen",
    "intro": "Ota haltuusi React, Redux, Node.js, MongoDB, GraphQL ja TypeScript! Kurssilla tutustutaan JavaScriptilla tapahtuvaan moderniin websovelluskehitykseen. Pääpaino on React-kirjaston avulla toteutettavissa single page -sovelluksissa, ja niitä tukevissa Node.js:llä toteutetuissa REST-rajapinnoissa.",
    "current": [
      "Vuoden 2021 versio kurssista päättyy kokeen osalta 10.1.2022. Tehtäviä voi palauttaa 28.2.2022 asti.",
      "Kurssin uudistettu versio alkaa 15.3.2022. Voit jatkaa nykyisen version suorittamista vuoden 2022 kurssilla <a href='/osa0/yleista#aiemmin-suoritetun-kurssin-taydentaminen'>tämän</a> ohjeen mukaisesti.",
      "Kurssiin liittyvää keskustelua Discordissa, kanavalla <a target='_blank' href='https://study.cs.helsinki.fi/discord/join/fullstack'>https://study.cs.helsinki.fi/discord/join/fullstack</a> sekä Telegramissa, kanavalla <a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>, tule mukaan! <ul><li>Huom: kaikki epäasialliset, halventavat ja jotain ihmisryhmää syrjivät kommentit kanavalla ovat kiellettyjä ja tälläisten kommenttien esittäjät poistetaan kanavalta.</li></ul>",
      "Kurssin tehtävien tekoon on tarjolla apua viikottaisessa ohjauksessa Kumpulan kampuksella Exactumissa BK107-luokassa. Ohjausta järjestetään maanantaisin ja keskiviikkoisin klo 14-16 välillä 8.11.-20.12.",
      "Yhteistyökumppaneina kurssilla on <a href='https://www.houston-inc.com/'>Houston Inc</a>, <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>, <a href='https://elisa.fi/'>Elisa</a>, <a href='https://www.kesko.fi/'>K-ryhmä</a>, <a href='https://www.instagram.com/unitytechnologies/?hl=en'>Unity Technologies</a>, <a href='https://careers.konecranes.com/Konecranes/'>Konecranes</a> ja <a href='https://www.smartly.io/'>Smartly.io</a>. Katso <a href='https://www.youtube.com/playlist?list=PLumQiZ25uijis31zaRL7rhzLalSwLqUtm'>täältä</a> yhteistyökumppaniemme asiantuntijoiden vierailuluentoja kurssin aihepiireistä."
    ],
    "telegram": "Telegram on whatsappin/messengerin tyylinen keskustelufoorumisovellus, jota on mahdollista käyttää selaimella, mobiililaitteilla ja Windows/Linux/OSX-clienteillä.",
    "notice": "Huom: kaikki epäasialliset, halventavat ja jotain ihmisryhmää syrjivät kommentit kanavalla ovat kiellettyjä ja tälläisten kommenttien esittäjät poistetaan kanavalta.",
    "licence": [
      "Kurssimateriaalin osat 0-8 ja 13 on tehnyt <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. Osa 9 on <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalon</a> ohjelmistokehittäjien tekemä. Osan 10 on tehnyt <a href='https://github.com/Kaltsoon'>Kalle Ilves</a>. Osa 11 on <a href='https://www.smartly.io/'>Smartlyn</a> ohjelmistokehittäjien tekemä ja osa 12 on tehnyt <a href='https://github.com/jakousa'>Jami Kousa</a>. Lukuisat <a href='https://github.com/fullstack-hy2020/misc/blob/master/contributors.md'>henkilöt</a> ovat parantaneet materiaalin laatua kirjoitus- ja asiavirhekorjauksin. Voit osallistua  kurssimateriaalin parantamiseen myös itse. <br/><br/> Sivuston designin on suunnitellut ja toteuttanut <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, joka on myös auditoinut kurssin sisällön.",
      "Tämä materiaali on lisensoitu <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>Creative Commons BY-NC-SA 3.0</a> -lisenssillä, joten voit käyttää ja levittää sitä vapaasti, kunhan alkuperäisten tekijöiden nimiä ei poisteta. Jos teet muutoksia materiaaliin ja haluat levittää muunneltua versiota, se täytyy lisensoida samalla lisenssillä. Materiaalien käyttö kaupalliseen tarkoitukseen on ilman erillistä lupaa kielletty."
    ],
    "university": "Helsingin yliopisto on Suomen vanhin ja suurin tiedekorkeakoulu, yhteensä 40 000 henkilön kansainvälinen tiedeyhteisö. Tieteen voimalla yliopist rakentanut yhteiskuntaa, sivistystä ja hyvinvointia jo vuodesta 1640.",
    "houston": "Suomalainen Houston Inc. on vuonna 2003 perustettu ketterä softatalo. Suunnittelemme ja toteutamme asiakkaillemme räätälöityjä digitaalisia palveluita liiketoiminnan tarpeisiin.",
    "contacts": ["Full stack open 2021", "matti.luukkainen@helsinki.fi"],
    "licenced": "Materiaali on lisensoitu Creative Commons BY-NC-SA 3.0 -lisenssillä."
  },
  "en": {
    "mainTitle": "Deep Dive Into Modern Web Development",
    "intro": "Learn React, Redux, Node.js, MongoDB, GraphQL and TypeScript in one go! This course will introduce you to modern JavaScript-based web development. The main focus is on building single page applications with ReactJS that use REST APIs built with Node.js.",
    "current": [
      "The last day to do the exam for the current course version is 10.1.2022. Exercises can be submitted until 28.2.2022.",
      "2022 edition will start 15.3.2022. There will not be much changes. You can continue the current course in the new edition, see  <a href='/en/part0/general_info#expanding-on-a-previously-completed-course'>this</a> for more see <a href='/en/part0/general_info#expanding-on-a-previously-completed-course'>this</a>.",
      "You can discuss the course and related topics in our dedicated group on Discord <a target='_blank' href='https://study.cs.helsinki.fi/discord/join/fullstack'>https://study.cs.helsinki.fi/discord/join/fullstack</a> and on Telegram: <a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>. Please join the conversation!"
    ],
    "telegram": "Telegram is a whatsapp / messenger-style discussion forum application that can be used with a browser, mobile devices, and Windows / Linux / OSX clients.",
    "notice": "NB: Inappropriate, degrading and discriminatory comments are strictly forbidden on the channel, and anyone who sends these types of messages will be permanently removed from the discussion.",
    "licence": [
      "Parts 0-8 and 13 of the course material is written by <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. The content of part 9 is written by developers from <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>. Part 10 is written by <a href='https://github.com/Kaltsoon'>Kalle Ilves</a>. The content of part 11 is written by developers from <a href='https://www.smartly.io/'>Smartly</a> and part 12 is by <a href='https://github.com/jakousa'>Jami Kousa</a> Numerous <a href='https://github.com/fullstack-hy2020/misc/blob/master/contributors.md'>people</a> have improved and corrected the material both in content and spelling. You can also make improvements to the course material yourself. The course webpage is designed and created by <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, who have also audited the content of the course material. Chinese translation by <a target='_blank' href='https://zhangwei.online/blog'>Zhang Wei</a>. Spanish translation by <a target='_blank' href='https://github.com/sebastiantorres86'>Sebastian Torres</a> and <a target='_blank' href='https://github.com/cynthiamv'>Cynthia Vico Vacca</a>.",
      "The course material is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>Creative Commons BY-NC-SA 3.0 license</a>, which means that you are free to use and distribute the material, as long as the names of the original authors are not removed. If you make changes to the material and want to distribute the modified version, it must be licensed under the same license. Using the material for commercial purposes is forbidden without permission."
    ],
    "university": "The University of Helsinki is the oldest and largest science university in Finland, with an international scientific community of 40,000 people.",
    "houston": "The Finnish Houston Inc. is an agile software company founded in 2003. We design and implement customized digital services for our business.",
    "contacts": ["Full stack open 2021", "matti.luukkainen@helsinki.fi"],
    "licenced": "The material is licensed under the Creative Commons BY-NC-SA 3.0 License."
  },
  "es": {
    "mainTitle": "Profundización en el desarrollo web moderno.",
    "intro": "¡Aprenda React, Redux, Node.js, MongoDB, GraphQL y TypeScript de una sola vez! Este curso le presentará el desarrollo web moderno basado en JavaScript. El enfoque principal es crear aplicaciones de una sola página con ReactJS que usan REST API creadas con Node.js.",
    "current": [
      "<a href='https://github.com/fullstack-hy2020/fullstack-hy2020.github.io/issues/1164'>Looking for contributors for the Spanish translation</a>",
      "Puede discutir el curso y temas relacionados en nuestro grupo dedicado en Telegram: <a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>. ¡Únase a la conversación!"
    ],
    "telegram": "Telegram es una aplicación de foro de discusión estilo whatsapp/messenger que se puede usar con un navegador, dispositivos móviles y clientes Windows/Linux/OSX.",
    "notice": "NB: Los comentarios inapropiados, degradantes y discriminatorios están estrictamente prohibidos en el canal, y cualquiera que envíe este tipo de mensajes será eliminado permanentemente de la discusión.",
    "licence": [
      "Las partes 0 a 8 del material del curso están escritas por <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. El contenido de la parte 9 está escrito por desarrolladores de <a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>. La parte 10 está escrita por <a href='https://github.com/Kaltsoon'>Kalle Ilves</a>. Numerosas <a href='https://github.com/fullstack-hy2020/misc/blob/master/contributors.md'>personas</a> han mejorado y corregido el material tanto en contenido como en ortografía. También puede realizar mejoras en el material del curso usted mismo. La página web del curso está diseñada y creada por <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, que también han auditado el contenido del material del curso. Traducción al chino de <a target='_blank' href='https://zhangwei.online/blog'>Zhang Wei</a>. Traducción al español de <a target='_blank' href='https://github.com/sebastiantorres86'>Sebastian Torres</a> y <a target='_blank' href='https://github.com/cynthiamv'>Cynthia Vico Vacca</a> con el apoyo de <a target='_blank' href='https://frontend.cafe/'>FrontendCafé</a>",
      "El material del curso tiene licencia de <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>licencia Creative Commons BY-NC-SA 3.0</a>, lo que significa que son libres de usar y distribuir el material, siempre que no se eliminen los nombres de los autores originales. Si realiza cambios en el material y desea distribuir la versión modificada, debe tener la misma licencia. El uso del material para con fines comerciales está prohibido sin permiso."
    ],
    "university": "La Universidad de Helsinki es la universidad de ciencias más grande y antigua de Finlandia, con una comunidad científica internacional de 40.000 personas.",
    "houston": "The Finnish Houston Inc. es una empresa de software ágil fundada en 2003. Diseñamos e implementamos servicios digitales personalizados para nuestro negocio.",
    "contacts": ["Full Stack Open 2021", "matti.luukkainen@helsinki.fi"],
    "licensed": "El material está sujeto a la licencia Creative Commons BY-NC-SA 3.0."
  },
  "zh": {
    "mainTitle": "深入浅出现代Web编程",
    "intro": "一站式学习 React, Redux, Node.js, MongoDB, GraphQL 以及 TypeScript！这门课程会向你介绍基于 JavaScript 的现代 Web 编程技术。重点是利用 ReactJS 搭配Node.js开发的REST API，来搭建单页面应用程序（SPA：Single Page Application）",
    "current": [
      "2021版本的课程已经开始啦！",
      "你可以加入我们的Telegram 群组<a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>来讨论课程以及相关的内容。快来加入我们吧！"
    ],
    "telegram": "Telegram是一个类似 whatsapp / messenger（国内的微信【译者注】） 讨论组应用，是一个多端应用，你可以在浏览器、手机设备以及Windows / Linux / OSX 客户端使用它。",
    "notice": "NB: Inappropriate, degrading and discriminatory comments are strictly forbidden on the channel, and anyone who sends these types of messages will be permanently removed from the discussion.",
    "licence": [
      "课程材料的0-8章节是<a href='https://github.com/mluukkai'>Matti Luukkainen</a> 所写的。第9章节的内容是由开发者<a href='https://www.terveystalo.com/fi/Yritystietoa/Terveystalo-tyontantajana/Digital-Health/'>Terveystalo</a>所著。很多<a href='https://github.com/fullstack-hy2020/misc/blob/master/contributors.md'>开发者</a>为了改进和修订课程材料做出了贡献，无论是课程内容还是拼写问题^_^。你也可以为这门课程的材料做出自己的贡献。这门课程的网站是由<a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>设计和创建的，它们同样审阅了这门课程的内容。英文版是由Ava Heinonen, Ilkka Kuisma, Harri Mehtälä and Jesper Pettersson 翻译的。中文版是由<a target='_blank' href='https://zhangwei.online/blog'>ZhangWei(微信wechat:richardzhangv)</a>翻译的。西班牙语是由<a target='_blank' href='https://github.com/sebastiantorres86'>Sebastian Torres</a> 和 <a target='_blank' href='https://github.com/cynthiamv'>Cynthia Vico Vacca</a>翻译的.",
      "这门课程内容的版权在<a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>Creative Commons BY-NC-SA 3.0 license</a>框架下执行。也就是说你可以自由的使用和分发课程材料，但要保留原作者信息，不能删除他们。如果你想要修改并分发修改后的版本，同样需要遵循这套协议。在没有许可的情况下将这门课程材料用于商业目的，是明令禁止的。"
    ],
    "university": "赫尔辛基大学（The University of Helsinki）是芬兰历史最悠久、规模最大的学术型大学，拥有40,000人的国际科学团体。",
    "houston": "芬兰的Houston Inc. 是一家敏捷型软件公司，成立于2003年。我们为业务的设计和实施提供个性的数字化解决方案。",
    "contacts": ["Full stack open 2021", "matti.luukkainen@helsinki.fi"],
    "licenced": "所有内容基于Creative Commons BY-NC-SA 3.0 License.协议框架。"
  }
}
