{
  "fi": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "Roolini Houstonilla keskittyy frontend-kehitykseen. Käytämme teknologioita ja kirjastoja laidasta laitaan, muun muassa kurssilla opetettuja teknologioita. Konsulttitalona autamme asiakkaitamme ja yhteistyökumppaneitamme saavuttamaan korkean laadun kautta paremman tuloksen. Tuomme projekteihin koodin lisäksi myös alan parhaat käytännöt ja autamme asiakkaitamme menestymään.",
        "Työskentely Houstonille on mahtavaa monesta syystä, eniten pidän siitä että työntekijät ovat aina ykkössijalla, henkilökunnan ideoita, ehdotuksia ja mielipiteitä todellakin kuunnellaan ja niihin reagoidaan. Esimerkiksi olen saanut Houstonilta täyden tuen mentorointiohjelman aloittamiseen. Autamme ihmisiä eri aloilta ohjelmoinnin parissa, opastamme heitä parhaiden käytäntöjen kanssa ja pyrimme saamaan heidät alalle. Tämä on opettanut sekä minulle että Houstonille todella paljon. Saankin todella paljon kiksejä muiden auttamisesta - olivat he sitten asiakkaita, työkavereita tai opiskelijoita."
      ],
      "name": "Juha Tauriainen",
      "title": "Senior Consultant"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "I am working at Unity as a Full-stack Software Engineer and have ten years of experience in software development including e.g. web applications, command and control systems and communication systems.",
        "I love being in software engineering because it is a combination of intelligent problem solving and creative work. Sometimes it makes me feel like I am a superhero! Then again there are always new things and subjects to learn and you get paid to do what you enjoy with people you like - work in engineering is fun! Our industry and customers are fun (games!) and it is great to do work that helps our customers to make a living with what they love.",
        "I like working at Unity because the work allows me to work with excellent colleagues and different personalities from all over the world who are also very good at their jobs. It is a perfect place to learn new technologies and explore new areas. Unity is a perfect workplace for me in ways that I can’t explain in just a few sentences."
      ],
      "name": "Burcu Aybak",
      "title": "Software Engineer"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "Minulla on usean vuoden kokemus terveydenhuollon teknologioista. Päädyin sovelluskehittäjäksi muutaman mutkan kautta, aloittaen urani proviisorina. Tämän jälkeen valmistuin tietojenkäsittelytieteiden maisteriksi ja siirryin kehityspäälliköksi ja edelleen sovelluskehittäjäksi.",
        "Viihdyn Terveystalossa, koska täällä pääsee itse vaikuttamaan sekä käytettäviin teknologioihin, että mihin projekteihin haluaa osallistua. Roolini ja kokemukseni ansiosta pääsen mukaan erilaisten uusien palveluiden aloitukseen ja kehittämiseen. Tällä hetkellä kehitän uutta mobiilipuolen sovellusta, joka näkee päivänvalonsa asiakkaiden parissa lähitulevaisuudessa.",
        "Haluan jatkossakin kehittyä omassa työssäni ja oppia koko ajan uutta. Multivendor-projekteissa työskentely yhdessä kokeneiden kollegojen kanssa ylläpitää ja kehittää omaa osaamista.",
        "Uskon, että Terveystalosta löytyy mielekkäitä ja uusia projekteja jatkossakin."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Sovelluskehittäjä ja digitaalinen moniosaaja"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "Alalla, jolla jatkuva oppiminen on melkeinpä elinehto, olen ollut onnekkaassa asemassa saadessani työskennellä uusimpien teknologioiden ja kokeneiden kollegojen kanssa. Roolissani Konecranesilla pääsen toimimaan kansainvälisessä ympäristössä ja kehittämään ratkaisuja, joilla tuodaan teollisen internetin hyödyt asiakkaan arkeen. Käytössämme oleva teknologiapaletti on hyvinkin rikas ja kehitysmenetelmät ovat muuttuneet yhä ketterämmiksi – myös kurssilla opiskeltavat sisällöt ovat läsnä tekemisessä.",
        "Oma tieni ohjelmistoalalle ei kulkenut suoraviivaisinta reittiä. Opiskelin aiemmin äidinkielen ja kirjallisuuden aineenopettajaksi, mutta päädyin muuntokoulutuksen kautta alanvaihtajaksi tähän hieman toisenlaiseen maailmaan, jossa toisaalta korostuvat yhtä lailla kielen ja kirjoittamisen taidot sekä luovuus. Osaltaan lähtökohtieni vuoksi olen ollut erityisen ilahtunut siitä, että Konecranesilla arvostetaan työntekijöiden erilaisia taustoja ja osaamista sekä tuetaan heidän kehittymistään. Sellaisessa ympäristössä uusi ala ja siellä kasvaminen on tuntunut luontevalta ja innostavalta."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Software Engineer"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "Työskentelen Elisalla ohjelmistokehittäjänä ja opiskelen samalla tietotekniikkaa Aalto-yliopistossa. Olen opintojeni loppuvaiheessa, ja alan pian tekemään diplomityötäni. Kurssejakin olen suorittanut samaan aikaan kuin olen ollut töissä täällä. Elisalle päädyin ystäväni suosituksesta, hän kertoi, että tämä on hyvä yritys olla töissä ja kehotti minua hakemaan.",
        "Tätä ennen olin töissä parissa muussa yrityksessä, yhteensä reilut 1,5 vuotta devaajana. Ohjelmointia olen harrastanut pienestä pitäen, ja olen aina tiennyt, että tietokoneet ovat oma juttuni. Ensimmäinen ohjelmointikieleni oli Java.",
        "Teen töitä Elisa Automatessa mobiiliverkon optimointialustan parissa, siis itse alustan, en niinkään optimointialgoritmien. Projekteissa käyttämiäni teknologioita ovat mm. Python, React, Elasticsearch ja Docker, ja itselleni parasta on juuri tämä full stack -tekeminen. Et ole mikään fronttisankari, vaan pääset tekemään kaikkea. Se pitää intohimoa yllä. Projektit ovat myös merkityksellisiä minulle. Se on kivaa että tehdään pioneerihommia, eikä vain omaa versiota jostain olemassaolevasta.",
        "Aluksi oli vähän vaikeaa päästä kärryille projektista, jossa työskentelen, mutta hiljalleen pääsin kunnolla vauhtiin. On ollut todella innostavaa, että kyseessä on jotain muuta kuin ”normaalin” nettisivun tekeminen. Työtä on helppo uppoutua tekemään yksin, mutta on tärkeää pitää mielessä tiimityön tärkeys. Ilman tiimityöskentelyä työt etenevät hitaasti ja saattaa ajautua tekemään väärää asiaa. Uusille työntekijöille (harjoittelijoille ja kokeneillekin) olisi suurta hyötyä tehdä esimerkiksi parikoodausta aluksi.",
        "Etukäteen minua kiinnosti tietää, olisiko isossa firmassa hirveän jäykkää menoa, mutta yllätyin positiivisesti siitä, että tiimi on niin ketterä. Työn edistäminen ei tunnu miltään suossa tarpomiselta, vaan ihan asfaltilla päästään kulkemaan. Ennen työn aloittamista ajattelin joutuvani herkästi johonkin tiukkaan siiloon, mutta todellisuudessa olen päässyt tekemään monipuolisesti erilaisia juttuja. Pitää kuitenkin muistaa itse pyytää sitä vaihtelevaa tekemistä! Omaa innostusta täytyy itse huoltaa.",
        "Haastattelu oli kaksivaiheinen. Aluksi tapasin tulevan esimieheni, joka luotasi, minkälainen ihminen olen. Eri päivänä oli tekninen haastattelu, jossa haisteltiin osaamistani juttelemalla ja pikkutehtävien kautta. Työhönotossa huomasi selkeästi inhimillisen puolen, ei pelkästään katsottu kuinka kova koodari on vaan että minkälainen persoona. Juteltiin koodista, ja selvästi katsottiin myös, kuinka hyvin pystyn kommunikoimaan ajatuksiani. Työnhausta ei tullut sellainen olo, että olisi vain minua tutkittu, vaan että etsittiin yhteistä säveltä, ja minulle rakentui kuva siitä, millaisia tulevat tiimiläiset ovat.",
        "Työkulttuuri täällä vastaa hyvin omia toiveitani, ja työtä on helppo järjestää oman elämän mukaan. Viestintä toimii myös hyvin, asioista kerrotaan tarpeeksifirman sisällä eikä ole tullut tunnetta siitä, että olisi jokin hämärä ”yläkerta” jossa asioista päätetään. Aina ei tietenkään tiedä, mitä kaikkea muualla tehdään, mutta se taitaa olla isoissa taloissa aina samoin.",
        "On riittävästi mahdollisuuksia kehittyä ja oppia uutta, ja pääsee hyödyntämäänomaa osaamista. Oma esimies ja tiimin ScrumMaster ehdottelee uusia asioita, nytkin olen menossa React Finland -tapahtumaan. Ylipäätään on joka päivä kivatulla töihin, ei harmita."
      ],
      "name": "Juho Kyrölä",
      "title": "Software Developer"
    },
    {
      "image": "holly_gibson_sq.jpg",
      "companyLogo": "smartly_io.svg",
      "text": [
        "I’m working as a software developer at Smartly.io, building our image and video templating tools and creating a beautiful and powerful experience for designers who make visual media. Our team works with JavaScript, React, and Node.js. From the first moment, I loved the culture at Smartly.io especially our value of being Humble Hungry Hunters. We have no egos here, and we’re humble.",
        "At the same time, we’re lifelong learners, hunting for new knowledge, and constantly leveling up. I have a bit of an alternative background. I used to work in IT at a university and took an online PHP class to improve my technical skills. I had the worst experience and thought I’d never become a developer. I went on to work at nonprofits in marketing, website management, and graphic design. My career in software development started when I took part in an intensive Ruby on Rails bootcamp. It was one of the hardest things I had done so far, but it landed me a job as the first—and only—developer in an ed-tech startup. As I was in charge of everything from th servers to the database to the web app, I needed to learn lots of new skills very quickly. I even rebuilt our server in the middle of a Finnish forest during my holiday after it got hacked! Having so much responsibility grew my confidence as a professional developer. Since then, I have worked in multiple companies with different tech stacks and frameworks and advanced to a team lead position.",
        "I’m one part engineer and one part artist. Coding allows me to use both halves of my brain: the logical part that loves puzzles and problem solving, and the artistic one that enjoys creating beautiful and functional user interfaces. There’s also a profoundly human element to developing software that I like. When we are building creative tools, we need to have empathy and understand our customers’ needs to succeed in producing something easy and powerful to use."
      ],
      "name": "Holly Gibson",
      "title": "Software Developer"
    }
  ],
  "en": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "My role at Houston concentrates on Frontend-development. We use a whole spectrum of technologies and libraries, including those taught in this course. As a consulting house we help our customers and partners to achieve better results through better quality. As well as the code, we bring the best practices of the field and help our customers to succeed.",
        "Working at Houston is awesome because of multiple reasons. The most I like that the employees are always number one. The ideas, suggestions and opinions of the staff are heard and reacted to. For example Houston gave me their full support to starting a mentorship program. We help people from different fields with programming, guide them to best practices and aim to get them to the business. This has taught both me and Houston very much. I get a huge kick out of helping others – no matter if they are customers, work mates or students."
      ],
      "name": "Juha Tauriainen",
      "title": "Senior Consultant"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "I am working at Unity as a Full-stack Software Engineer and have ten years of experience in software development including e.g. web applications, command and control systems and communication systems.",
        "I love being in software engineering because it is a combination of intelligent problem solving and creative work. Sometimes it makes me feel like I am a superhero! Then again there are always new things and subjects to learn and you get paid to do what you enjoy with people you like - work in engineering is fun! Our industry and customers are fun (games!) and it is great to do work that helps our customers to make a living with what they love.",
        "I like working at Unity because the work allows me to work with excellent colleagues and different personalities from all over the world who are also very good at their jobs. It is a perfect place to learn new technologies and explore new areas. Unity is a perfect workplace for me in ways that I can’t explain in just a few sentences."
      ],
      "name": "Burcu Aybak",
      "title": "Software Engineer"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "I have many years of experience on health technologies. I ended up as a software developer after a few twists and turns. I started out as a pharmacist. Then I graduated as a Master of Computer Science and proceeded to work as a development director and later as a software developer.",
        "I enjoy working at Terveystalo, because here you have a say on the technologies we use and which projects you want to take part on. Due to my role and my experience I get to take part on starting and developing different new services. Right now I develop a new mobile application, which will see the light of day among customers in the near future. ",
        "In the future I want to continue to advance in my job and to keep learning. Working in  multivendor-projects with experienced colleagues maintains and  develops my skills.",
        "I believe Terveystalo will keep offering new meaningful projects in the future."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Sovelluskehittäjä ja digitaalinen moniosaaja"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "In a field where continuous learning is almost vital, I have been lucky to get to work with the latest technologies and experienced colleagues. In my role at Konecranes I get to work in an international environment and develop solutions which bring the benefits of industrial internet to the everyday lives of our customers. The technology palette we use is rich, and the development methods have become even more agile – the contents covered by this course are also present in our work.",
        "My road to IT was not the most straight forwards. I studied as a Finnish teacher, but ended up, after continuing my education, shifting careers to this different world where language and  writing skills and creativity are emphazised as well. Partly due to my background I have been delighted, that at Konecrass the different backgrounds and skills of the employees are appreciated and their advancement is supported. In this kind of environment the new field and developing in it has felt natural and motivating."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Software Engineer"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "I work at Elisa as a software developer and study IT at Aalto University. I am at the end of my studies, and will soon begin my thesis. I have also completed courses and worked here at the same time. I ended up at Elisa because of a recommendation from a friend, he told me, that this is a good company to work for and urged me to apply.",
        "Previously I worked for a couple other companies for roughly 1.5 years as a developer. Programming has been a hobby of mine since childhood, and I have always known computers are my thing. My first programming language was Java.",
        "I work at Elisa Automate working on an optimization platform for mobile networks. I work with the platform itself, not the optimization algorithms. Technologies I have used for projects include Python, React, Elasticsearch and Docker, and for me the best is exactly this – full stack programming. You are not a front end hero, but you get to do it all. It keeps the passion up. The projects are also meaningful for me. It’s fun that we are the pioneers of the field and not just doing our own versions of something already existing.",
        "In the beginning it was a bit difficult to get the hang of the project I work on, but bit by bit I got there. It has been really motivating, that this is something else than just creating a “normal” website.  It is easy to immerse yourself with the work alone, but it is important to keep the importance of team work in mind. Without teamwork the work proceeds slowly and you might end up doing the wrong thing. For new employees (both trainees and more experienced coders) it would be beneficial to do for example parner coding in the beginning.",
        "Beforehand I was interested to know, wether the culture in a large company would be very stuck up, but I was pleasantly surprised that my team is so agile. Advancing the work does not feel like getting blood from a stone, but is almost a walk in the park. Before starting my job I thought I would easily end up tighly siloed, but in reality I have been able to do diversely different things. You just have to ask for diverse things to do yourself! You have to take charge of your own motivation.",
        "The interview had two parts. First I met my future boss, who determined wha kind of person I am. On a different day there was a technical interview, where my competence was tested through chatting and small exercises. Thjroughout the process you could clearly see the humane side, they did not only care about how good a coder you are, but also who you are as a person. The application process did not give me the feeling of being examined, but that we were looking for a common ground, and I got a feel of who my future teammates are.",
        "The corporate culture here meets my expectations, and it is easy to arrange your job around your life. Communication also works well, things are discussed enough within the company, and I have not gotten the feeling that there is this shady “upper floor” where everything is decided. Of course you don’t always know what is being done in other teams, but that seems to be the same in every other big company.",
        "There are enough opportunities to advance and learn, and you get to use your skills. Your manager and your teams scrum master proposes different things, now I am going to React Finland event. All in all, it’s fun rather than annoying to come to work everyday."
      ],
      "name": "Juho Kyrölä",
      "title": "Software Developer"
    },
    {
      "image": "holly_gibson_sq.jpg",
      "companyLogo": "smartly_io.svg",
      "text": [
        "I’m working as a software developer at Smartly.io, building our image and video templating tools and creating a beautiful and powerful experience for designers who make visual media. Our team works with JavaScript, React, and Node.js. From the first moment, I loved the culture at Smartly.io especially our value of being Humble Hungry Hunters. We have no egos here, and we’re humble.",
        "At the same time, we’re lifelong learners, hunting for new knowledge, and constantly leveling up. I have a bit of an alternative background. I used to work in IT at a university and took an online PHP class to improve my technical skills. I had the worst experience and thought I’d never become a developer. I went on to work at nonprofits in marketing, website management, and graphic design. My career in software development started when I took part in an intensive Ruby on Rails bootcamp. It was one of the hardest things I had done so far, but it landed me a job as the first—and only—developer in an ed-tech startup. As I was in charge of everything from th servers to the database to the web app, I needed to learn lots of new skills very quickly. I even rebuilt our server in the middle of a Finnish forest during my holiday after it got hacked! Having so much responsibility grew my confidence as a professional developer. Since then, I have worked in multiple companies with different tech stacks and frameworks and advanced to a team lead position.",
        "I’m one part engineer and one part artist. Coding allows me to use both halves of my brain: the logical part that loves puzzles and problem solving, and the artistic one that enjoys creating beautiful and functional user interfaces. There’s also a profoundly human element to developing software that I like. When we are building creative tools, we need to have empathy and understand our customers’ needs to succeed in producing something easy and powerful to use."
      ],
      "name": "Holly Gibson",
      "title": "Software Developer"
    }
  ],
  "es": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "Mi función en Houston se concentra en el desarrollo del frontend. Utilizamos una amplia gama de tecnologías y bibliotecas, incluidas las que se enseñan en este curso. Como empresa de consultoría, ayudamos a nuestros clientes y socios a lograr mejores resultados a través de una mejor calidad. Así como el código, traemos las mejores prácticas del campo y ayudamos a nuestros clientes a tener éxito.",
        "Trabajar en Houston es fantástico por varias razones. Lo que más me gusta es que los empleados son siempre el número uno. Las ideas, sugerencias y opiniones del personal son escuchadas y reaccionadas. Por ejemplo, Houston me brindó todo su apoyo para iniciar una tutoría Ayudamos a personas de diferentes campos con la programación, los guiamos hacia las mejores prácticas y nuestro objetivo es llevarlos al negocio. Esto nos ha enseñado mucho a mí y a Houston. Me encanta ayudar a los demás, sin importar si clientes, compañeros de trabajo o estudiantes."
      ],
      "name": "Juha Tauriainen",
      "title": "Consultor senior"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "Trabajo en Unity como ingeniero de software full stack y tengo diez años de experiencia en el desarrollo de software, que incluyen, por ejemplo, aplicaciones web, sistemas de comando y control y sistemas de comunicación.",
        "Me encanta estar en ingeniería de software porque es una combinación de resolución inteligente de problemas y trabajo creativo. ¡A veces me hace sentir como un superhéroe! Por otra parte, siempre hay cosas y temas nuevos que aprender y te pagan por hacer lo que quieres. disfruta con la gente que te gusta - ¡trabajar en ingeniería es divertido! Nuestra industria y los clientes son divertidos (¡juegos!) y es genial hacer un trabajo que ayude a nuestros clientes a ganarse la vida con lo que aman.",
        "Me gusta trabajar en Unity porque el trabajo me permite trabajar con excelentes colegas y diferentes personalidades de todo el mundo que también son muy buenos en sus trabajos. Es un lugar perfecto para aprender nuevas tecnologías y explorar nuevas áreas. Unity es un lugar de trabajo perfecto para mí de una manera que no puedo explicar en unas pocas frases."
      ],
      "name": "Burcu Aybak",
      "title": "Ingeniero de software"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "Tengo muchos años de experiencia en tecnologías de la salud. Terminé como desarrollador de software después de algunos giros y vueltas. Comencé como farmacéutico. Luego me gradué como Maestría en Ciencias de la Computación y procedí a trabajar como director de desarrollo y más tarde como desarrollador de software.",
        "Disfruto trabajando en Terveystalo, porque aquí tienes voz sobre las tecnologías que usamos y en qué proyectos quieres participar. Debido a mi rol y mi experiencia puedo participar en la puesta en marcha y desarrollo de diferentes nuevos servicios. Ahora mismo Desarrollo una nueva aplicación móvil, que verá la luz entre los clientes en un futuro próximo.",
        "En el futuro quiero seguir avanzando en mi trabajo y seguir aprendiendo. Trabajar en proyectos de múltiples proveedores con colegas experimentados mantiene y desarrolla mis habilidades.",
        "Creo que Terveystalo seguirá ofreciendo nuevos proyectos significativos en el futuro."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Desarrollador de aplicaciones y multi-experto digital"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "En un campo donde el aprendizaje continuo es casi vital, he tenido la suerte de poder trabajar con las últimas tecnologías y colegas experimentados. En mi puesto en Konecranes puedo trabajar en un entorno internacional y desarrollar soluciones que aportan los beneficios de Internet industrial a la vida cotidiana de nuestros clientes. La paleta tecnológica que utilizamos es rica, y los métodos de desarrollo se han vuelto aún más ágiles, los contenidos cubiertos por este curso también están presentes en nuestro trabajo.",
        "Mi camino hacia la tecnología de la información no fue el más sencillo. Estudié como profesora de finlandés, pero terminé, después de continuar mi educación, cambiando mi carrera hacia este mundo diferente donde también se enfatizan las habilidades de lenguaje y escritura y la creatividad. Antecedentes Estoy encantado de que en Konecrass se aprecien los diferentes antecedentes y habilidades de los empleados y se apoye su avance. En este tipo de entorno, el nuevo campo y el desarrollo en él se ha sentido natural y motivador."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Ingeniero de software"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "Trabajo en Elisa como desarrolladora de software y estudio TI en la Universidad Aalto. Estoy terminando mis estudios y pronto comenzaré mi tesis. También he completado cursos y trabajé aquí al mismo tiempo. Terminé en Elisa debido a una recomendación de un amigo, me dijo, que este es un buen lugar para trabajar y me instó a aplicar.",
        "Anteriormente trabajé para un par de otras empresas durante aproximadamente 1,5 años como desarrollador. La programación ha sido un pasatiempo mío desde la infancia, y siempre supe que lo mío son las computadoras. Mi primer lenguaje de programación fue Java.",
        "Trabajo en Elisa Automate trabajando en una plataforma de optimización para redes móviles. Trabajo con la plataforma en sí, no con los algoritmos de optimización. Las tecnologías que he usado para proyectos incluyen Python, React, Elasticsearch y Docker, y para mí lo mejor es exactamente esto - programación de pila completa. No eres un héroe de front-end, pero puedes hacerlo todo. Mantiene la pasión. Los proyectos también son significativos para mí. Es divertido que seamos los pioneros en el campo y no solo propias versiones de algo ya existente.",
        "Al principio fue un poco difícil entender el proyecto en el que estoy trabajando, pero poco a poco llegué allí. Ha sido muy motivador, que esto sea algo más que crear un sitio web 'normal'. Es fácil sumergirse solo en el trabajo, pero es importante tener en cuenta la importancia del trabajo en equipo. Sin trabajo en equipo, el trabajo avanza lentamente y podría terminar haciendo algo incorrecto. Para los nuevos empleados (tanto aprendices como codificadores más experimentados) sería beneficioso hacer, por ejemplo, codificación de pares al principio.",
        "De antemano me interesaba saber si la cultura en una gran empresa estaría muy estancada, pero me sorprendió gratamente que mi equipo sea tan ágil. Avanzar en el trabajo no se siente como sacar sangre de una piedra, pero es casi un caminar en el parque. Antes de comenzar mi trabajo pensé que fácilmente terminaría encerrado, pero en realidad he podido hacer cosas muy diferentes. ¡Solo tienes que pedir diversas cosas para hacer tú mismo! Tienes que hacerte cargo de tu propia motivación.",
        "La entrevista tuvo dos partes. Primero conocí a mi futuro jefe, quien determinó qué tipo de persona soy. En otro día hubo una entrevista técnica, donde se puso a prueba mi competencia a través de charlas y pequeños ejercicios. A lo largo del proceso se podía claramente Mira el lado humano, no solo se preocuparon por lo buen codificador que eres, sino también por quién eres como persona. El proceso de solicitud no me dio la sensación de estar siendo examinado, sino que estábamos buscando un terreno común, y tengo una idea de quiénes son mis futuros compañeros.",
        "La cultura corporativa aquí cumple con mis expectativas y es fácil organizar su trabajo en torno a su vida. La comunicación también funciona bien, las cosas se discuten lo suficiente dentro de la empresa y no tengo la sensación de que exista este 'piso superior' turbio donde todo se decide. por supuesto que no siempre saben lo que se está haciendo en otros equipos, pero que parece ser la misma en todas las otras compañías grandes.",
        "Hay suficientes oportunidades para avanzar y aprender, y puedes usar tus habilidades. Tu manager y el scrum master de tu equipo proponen cosas diferentes, ahora voy al evento React Finland. En general, es divertido en lugar de molesto venir a trabajar todos los días."
      ],
      "name": "Juho Kyrölä",
      "title": "Desarrollador de software"
    },
    {
      "image": "holly_gibson_sq.jpg",
      "companyLogo": "smartly_io.svg",
      "text": [
        "Trabajo como desarrollador de software en Smartly.io, construyendo nuestras herramientas de creación de plantillas de imágenes y videos y creando una experiencia hermosa y poderosa para los diseñadores que crean medios visuales. Nuestro equipo trabaja con JavaScript, React y Node.js. En el primer momento, me encantó la cultura en Smartly.io, especialmente nuestro valor de ser Humble Hungry Hunters. No tenemos egos aquí, y somos humildes.",
        "¡Incluso reconstruí nuestro servidor en medio de un bosque finlandés durante mis vacaciones después de que fue pirateado! Tener tanta responsabilidad hizo crecer mi confianza como desarrollador profesional. Desde entonces, he trabajado en varias empresas con diferentes tipos de tecnología y marcos y he avanzado a una posición de líder de equipo ",
        "Soy en parte ingeniero y en parte artista. La codificación me permite usar ambas mitades de mi cerebro: la parte lógica que ama los acertijos y la resolución de problemas, y la parte artística que disfruta creando interfaces de usuario hermosas y funcionales. También hay un profundo elemento humano para desarrollar software que me guste. Cuando estamos construyendo herramientas creativas, necesitamos tener empatía y comprender las necesidades de nuestros clientes para tener éxito en la producción de algo fácil y poderoso de usar."
      ],
      "name": "Holly Gibson",
      "title": "Desarrollador de software"
    }
  ],
  "zh": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "我在Houston的任务集中在前端开发上。我们会使用各种技术和库，当然包括本课程中讲授的技术和库。作为一家咨询公司，我们帮助客户和合作伙伴通过更高的质量获得更好的结果。除了代码外，我们还带来了该领域的最佳实践，并帮助我们的客户取得成功。",
        "从很多方面来说，在Houston工作真是棒极了。我最喜欢员工至上的理念。听取并回应员工的想法，建议和意见。例如，Houston全力支持我启动导师计划。我们帮助来自不同领域的人员进行编程，指导他们获得最佳实践，并致力于使他们融入业务。这对我和Houston都非常有帮助。无论对方是客户，同事还是学生，我都会竭尽全力帮助他人。"
      ],
      "name": "Juha Tauriainen",
      "title": "高级顾问"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "我在Unity工作，是一名全栈软件工程师，在软件开发方面拥有十年的经验，包括Web应用程序，命令和控制系统以及通信系统。",
        "我喜欢从事软件工程，因为它是智能解决问题和创造性工作的结合。有时候让我觉得自己是超级英雄！再者说来，总会有新的事物和学科要学习，而与自己喜欢的人一起做自己喜欢的事情，就会得到报酬–工程工作真的很有趣！我们的行业和客户也都很有趣（因为是游戏业啊！），并且工作可以帮助我们的客户以他们所钟爱的方式谋生，这简直棒极了。",
        "我喜欢在Unity工作，因为这项工作使我可以与优秀的同事一起工作,他们来自世界各地且拥有不同的个性，他们同样很擅长工作。这里是学习新技术和探索新领域的理想场所。对于我来说，Unity是一个理想的工作场所，而我只用几句话是无法解释的。"
      ],
      "name": "Burcu Aybak",
      "title": "软件工程师"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "我在健康技术领域拥有多年经验。几经周折，我最终成为一名软件工程师。我最初是一名药剂师。然后，我以计算机科学硕士学位毕业，然后开始担任开发主管，后来又担任软件开发人员。",
        "我喜欢在Terveystalo工作，因为在这里，您对我们使用的技术以及您要参与的项目有发言权。由于我的角色和经验，我会参与启动和开发不同的新服务。现在，我正在开发一个新的移动应用程序，该应用程序将在不久的将来在客户中迎来高光时刻。",
        "将来，我想继续前进，继续学习。在多供应商项目中工作，项目成员由具有经验丰富的专家组成，这可以保持和发展我的技能。",
        "我相信Terveystalo将来会继续提供新的且有意义的项目。"
      ],
      "name": "Tuukka Peuraniemi",
      "title": "软件开发工程师"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "在一个持续学习至关重要的领域，我很幸运能够使用最新技术，并拥有经验丰富的同事。在Konecranes 任职期间，我致力于在国际环境中工作并开发解决方案，将工业互联网的优势带入客户的日常生活中。我们使用的技术选型丰富，开发方法变得更加敏捷-本课程涵盖的内容也出现在我们的工作中。",
        "我的IT之路有点曲折。我学习的芬兰语教师，但在继续接受教育之后，最终将职业转移到了另一个强调语言、写作技巧和创造力的世界。在一定程度上，由于我的背景，我在Konecrass工作得很开心，不同背景的员工和技能能够得到赏识，他们的优势得以展现。在这种环境下，新的领域和在其中的发展感到自然而又充满活力。"
      ],
      "name": "Kristiina Rönnberg",
      "title": "软件工程师"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "我在Elisa担任软件开发人员，并在 Aalto University 学习IT。我正在完我的学业，并将很快开始我的论文。我还完成了课程并同时在这里工作。由于一位朋友的推荐，我最终来到了Elisa，他告诉我，这是一家值得工作的好公司，并敦促我应聘。",
        "之前，我曾在其他几家公司担任开发人员，工作了约1.5年。从小开始，编程一直是我的爱好，而我一直都知道计算机是我的事业。我的第一种编程语言是Java。",
        "我在Elisa Automate工作，致力于移动网络优化平台。我使用平台本身，而不是优化算法。我用于项目的技术包括Python，React，Elasticsearch和Docker，对我来说，最好的就是全栈编程。虽然不是前端英雄，但我可以做到。它让我始终保持激情。这些项目对我也很有意义。很有趣，我们是该领域的开拓者，而不仅仅是造自己的轮子",
        "刚开始时，我很难掌握我正在从事的项目，但是日拱一卒地到达了那里。这其中真正的动机是，这不仅仅是创建一个“普通的”网站。让自己沉浸在工作中很容易，但是重要的是要牢记团队合作的重要性。没有团队合作，工作进展缓慢，您可能会做错事。对于新员工（无论是培训生还是经验丰富的编码人员），一开始就进行结对编程是非常有益的。",
        "之前我很好奇，就是大型公司的文化会非常僵化，但是我很高兴我的团队如此敏捷。我的工作并非举步维艰，而是轻松如在公园里散步。在开始我的工作之前，我以为我会轻易地被束之高阁，但是实际上我已经能够做各种各样的事情。您只需要要求各种各样的事情来实现自己的价值！命运掌握在自己手中。",
        "面试分为两个部分。首先，我遇到了我未来的老板，老板确定了我是什么样的人。在另一天，进行了一次技术面试，通过聊天和小练习对我的能力进行了测试。在整个过程中，您可以清楚地看到人性化的一面，他们不仅在乎您是多么优秀的编码人员，而且还在乎你究竟是谁。面试过程并没有给我带来被审查的感觉，我们一直在寻找共同点，而且我对未来的队友也有了预期。",
        "这里的企业文化符合我的期望，很容易在自己的生活中安排好工作。沟通也很顺利，公司内部对事情讨论得足够充分，并且我从没有那种一切早已被决定的”潜规则“。当然，您并不总是知道其他团队正在做什么，但这似乎在其他所有大公司中都是一样的。",
        "这里有充足的进步与学习的机会，并且您可以充分利用自己的技能。您的经理和您的团队Scrum主管会提出做点不同的事情，现在我要参加React Finland活动。总而言之，每天上班都很有趣，而不是感到厌倦。"
      ],
      "name": "Juho Kyrölä",
      "title": "软件工程师"
    },
    {
      "image": "holly_gibson_sq.jpg",
      "companyLogo": "smartly_io.svg",
      "text": [
        "我现在是Smartly.io的软件开发工程师，正在构建图像和视频模板工具，并为制作视觉媒体的设计师创造美好而强大的体验。我们的团队使用JavaScript，React和Node.js。从一开始，我就很喜欢Smartly.io的文化，尤其是我们作为谦卑的饥饿猎人的价值观。我们这里没有自负，我们很谦虚。",
        "同时，我们是终身学习者，正在寻找新知识并不断提高水平。我有一些不同的背景。我曾经在大学的IT部门工作，并参加了在线PHP课程来提高我的技术技能。我经历了最糟糕的经历，以为我永远不会成为开发人员。我继续在非营利组织的市场，网站管理和图形设计领域工作。我参加了密集的Ruby on Rails训练营，开始了我的软件开发生涯。到目前为止，这是我做过的最艰难的事情之一，但它让我找到了一份工作，成为第一家（也是唯一一家）电子技术初创公司的开发人员。当我负责从服务器到数据库再到Web应用程序的所有工作时，我需要非常快地学习很多新技能。遭到入侵后，我甚至在假期中在芬兰的森林中间重建了服务器！承担如此多的责任使我成为专业开发人员的信心增强了。从那时起，我就在多家公司工作，这些公司具有不同的技术栈和框架，并晋升为团队负责人。",
        "我是一名零件工程师和一半工程师一半画家。编码使我可以同时使用大脑两个半球：喜欢拼图和解决问题的逻辑部分，以及喜欢创建美观实用的用户界面的艺术部分。开发我喜欢的软件还具有深远的人为因素。当我们构建创意工具时，我们需要有同理心，了解客户需要易于使用且功能强大的产品来获得成功。"
      ],
      "name": "Holly Gibson",
      "title": "软件工程师"
    }
  ]
}
