{
  "fi": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "Roolini Houstonilla keskittyy frontend-kehitykseen. Käytämme teknologioita ja kirjastoja laidasta laitaan, muun muassa kurssilla opetettuja teknologioita. Konsulttitalona autamme asiakkaitamme ja yhteistyökumppaneitamme saavuttamaan korkean laadun kautta paremman tuloksen. Tuomme projekteihin koodin lisäksi myös alan parhaat käytännöt ja autamme asiakkaitamme menestymään.",
        "Työskentely Houstonille on mahtavaa monesta syystä, eniten pidän siitä että työntekijät ovat aina ykkössijalla, henkilökunnan ideoita, ehdotuksia ja mielipiteitä todellakin kuunnellaan ja niihin reagoidaan. Esimerkiksi olen saanut Houstonilta täyden tuen mentorointiohjelman aloittamiseen. Autamme ihmisiä eri aloilta ohjelmoinnin parissa, opastamme heitä parhaiden käytäntöjen kanssa ja pyrimme saamaan heidät alalle. Tämä on opettanut sekä minulle että Houstonille todella paljon. Saankin todella paljon kiksejä muiden auttamisesta - olivat he sitten asiakkaita, työkavereita tai opiskelijoita."
      ],
      "name": "Juha Tauriainen",
      "title": "Senior Consultant"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "Minulla on usean vuoden kokemus terveydenhuollon teknologioista. Päädyin sovelluskehittäjäksi muutaman mutkan kautta, aloittaen urani proviisorina. Tämän jälkeen valmistuin tietojenkäsittelytieteiden maisteriksi ja siirryin kehityspäälliköksi ja edelleen sovelluskehittäjäksi.",
        "Viihdyn Terveystalossa, koska täällä pääsee itse vaikuttamaan sekä käytettäviin teknologioihin, että mihin projekteihin haluaa osallistua. Roolini ja kokemukseni ansiosta pääsen mukaan erilaisten uusien palveluiden aloitukseen ja kehittämiseen. Tällä hetkellä kehitän uutta mobiilipuolen sovellusta, joka näkee päivänvalonsa asiakkaiden parissa lähitulevaisuudessa.",
        "Haluan jatkossakin kehittyä omassa työssäni ja oppia koko ajan uutta. Multivendor-projekteissa työskentely yhdessä kokeneiden kollegojen kanssa ylläpitää ja kehittää omaa osaamista.",
        "Uskon, että Terveystalosta löytyy mielekkäitä ja uusia projekteja jatkossakin."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Sovelluskehittäjä ja digitaalinen moniosaaja"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "Työskentelen Elisalla ohjelmistokehittäjänä ja opiskelen samalla tietotekniikkaa Aalto-yliopistossa. Olen opintojeni loppuvaiheessa, ja alan pian tekemään diplomityötäni. Kurssejakin olen suorittanut samaan aikaan kuin olen ollut töissä täällä. Elisalle päädyin ystäväni suosituksesta, hän kertoi, että tämä on hyvä yritys olla töissä ja kehotti minua hakemaan.",
        "Tätä ennen olin töissä parissa muussa yrityksessä, yhteensä reilut 1,5 vuotta devaajana. Ohjelmointia olen harrastanut pienestä pitäen, ja olen aina tiennyt, että tietokoneet ovat oma juttuni. Ensimmäinen ohjelmointikieleni oli Java.",
        "Teen töitä Elisa Automatessa mobiiliverkon optimointialustan parissa, siis itse alustan, en niinkään optimointialgoritmien. Projekteissa käyttämiäni teknologioita ovat mm. Python, React, Elasticsearch ja Docker, ja itselleni parasta on juuri tämä full stack -tekeminen. Et ole mikään fronttisankari, vaan pääset tekemään kaikkea. Se pitää intohimoa yllä. Projektit ovat myös merkityksellisiä minulle. Se on kivaa että tehdään pioneerihommia, eikä vain omaa versiota jostain olemassaolevasta.",
        "Aluksi oli vähän vaikeaa päästä kärryille projektista, jossa työskentelen, mutta hiljalleen pääsin kunnolla vauhtiin. On ollut todella innostavaa, että kyseessä on jotain muuta kuin ”normaalin” nettisivun tekeminen. Työtä on helppo uppoutua tekemään yksin, mutta on tärkeää pitää mielessä tiimityön tärkeys. Ilman tiimityöskentelyä työt etenevät hitaasti ja saattaa ajautua tekemään väärää asiaa. Uusille työntekijöille (harjoittelijoille ja kokeneillekin) olisi suurta hyötyä tehdä esimerkiksi parikoodausta aluksi.",
        "Etukäteen minua kiinnosti tietää, olisiko isossa firmassa hirveän jäykkää menoa, mutta yllätyin positiivisesti siitä, että tiimi on niin ketterä. Työn edistäminen ei tunnu miltään suossa tarpomiselta, vaan ihan asfaltilla päästään kulkemaan. Ennen työn aloittamista ajattelin joutuvani herkästi johonkin tiukkaan siiloon, mutta todellisuudessa olen päässyt tekemään monipuolisesti erilaisia juttuja. Pitää kuitenkin muistaa itse pyytää sitä vaihtelevaa tekemistä! Omaa innostusta täytyy itse huoltaa.",
        "Haastattelu oli kaksivaiheinen. Aluksi tapasin tulevan esimieheni, joka luotasi, minkälainen ihminen olen. Eri päivänä oli tekninen haastattelu, jossa haisteltiin osaamistani juttelemalla ja pikkutehtävien kautta. Työhönotossa huomasi selkeästi inhimillisen puolen, ei pelkästään katsottu kuinka kova koodari on vaan että minkälainen persoona. Juteltiin koodista, ja selvästi katsottiin myös, kuinka hyvin pystyn kommunikoimaan ajatuksiani. Työnhausta ei tullut sellainen olo, että olisi vain minua tutkittu, vaan että etsittiin yhteistä säveltä, ja minulle rakentui kuva siitä, millaisia tulevat tiimiläiset ovat.",
        "Työkulttuuri täällä vastaa hyvin omia toiveitani, ja työtä on helppo järjestää oman elämän mukaan. Viestintä toimii myös hyvin, asioista kerrotaan tarpeeksifirman sisällä eikä ole tullut tunnetta siitä, että olisi jokin hämärä ”yläkerta” jossa asioista päätetään. Aina ei tietenkään tiedä, mitä kaikkea muualla tehdään, mutta se taitaa olla isoissa taloissa aina samoin.",
        "On riittävästi mahdollisuuksia kehittyä ja oppia uutta, ja pääsee hyödyntämäänomaa osaamista. Oma esimies ja tiimin ScrumMaster ehdottelee uusia asioita, nytkin olen menossa React Finland -tapahtumaan. Ylipäätään on joka päivä kivatulla töihin, ei harmita."
      ],
      "name": "Juho Kyrölä",
      "title": "Software Developer"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "I am working at Unity as a Full-stack Software Engineer and have ten years of experience in software development including e.g. web applications, command and control systems and communication systems.",
        "I love being in software engineering because it is a combination of intelligent problem solving and creative work. Sometimes it makes me feel like I am a superhero! Then again there are always new things and subjects to learn and you get paid to do what you enjoy with people you like - work in engineering is fun! Our industry and customers are fun (games!) and it is great to do work that helps our customers to make a living with what they love.",
        "I like working at Unity because the work allows me to work with excellent colleagues and different personalities from all over the world who are also very good at their jobs. It is a perfect place to learn new technologies and explore new areas. Unity is a perfect workplace for me in ways that I can’t explain in just a few sentences."
      ],
      "name": "Burcu Aybak",
      "title": "Software Engineer"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "Alalla, jolla jatkuva oppiminen on melkeinpä elinehto, olen ollut onnekkaassa asemassa saadessani työskennellä uusimpien teknologioiden ja kokeneiden kollegojen kanssa. Roolissani Konecranesilla pääsen toimimaan kansainvälisessä ympäristössä ja kehittämään ratkaisuja, joilla tuodaan teollisen internetin hyödyt asiakkaan arkeen. Käytössämme oleva teknologiapaletti on hyvinkin rikas ja kehitysmenetelmät ovat muuttuneet yhä ketterämmiksi – myös kurssilla opiskeltavat sisällöt ovat läsnä tekemisessä.",
        "Oma tieni ohjelmistoalalle ei kulkenut suoraviivaisinta reittiä. Opiskelin aiemmin äidinkielen ja kirjallisuuden aineenopettajaksi, mutta päädyin muuntokoulutuksen kautta alanvaihtajaksi tähän hieman toisenlaiseen maailmaan, jossa toisaalta korostuvat yhtä lailla kielen ja kirjoittamisen taidot sekä luovuus. Osaltaan lähtökohtieni vuoksi olen ollut erityisen ilahtunut siitä, että Konecranesilla arvostetaan työntekijöiden erilaisia taustoja ja osaamista sekä tuetaan heidän kehittymistään. Sellaisessa ympäristössä uusi ala ja siellä kasvaminen on tuntunut luontevalta ja innostavalta."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Software Engineer"
    },
    {
      "image": "mikko_kotola_ja_panu_vartiainen.jpg",
      "companyLogo": "sympa.svg",
      "text": [
        "Suoritin Full stack -kurssin ensimmäisten joukossa alkuvuodesta 2018. Kurssi oli todella tärkeä osa tietojenkäsittelytieteen kandiopintojani. Single page web appien logiikka ja modernit työkalut tulivat tutuksi. Yleisemmin ottaen minulle oli tärkeää saada rutiinia asynkroniseen ja funktionaaliseen ohjelmointiin.  Kurssi ei tuntunut aina helpolta: välillä oli kyllä otsa kipeänä kun jotakin kiharaista kohtaa viilasi. Mutta tekemällähän sitä asioita opitaan!",
        "Sain kandiopintoni päätökseen kesällä 2018 ja aloitin full stack -kehittäjän tehtävässä Sympalla syksyllä. Sympa tarjoaa asiakkailleen henkilöstöjärjestelmiä SaaS-toimintamallilla. Yrityksessä on yli 100 työntekijää viidessä maassa, ja kasvu on nopeaa. Minulle työnpaikan vaihdos oli samalla toimialan vaihdos, sillä olen aiemmalta koulutukseltani valtiotieteiden maisteri ja työskentelin aiemmin yliopiston hallinnossa. Innostus koodaukseen imaisi minut kuitenkin mukaansa opintoihin ja uudelle alalle.",
        "Sympassa minua viehätti se, että yritys oli sopivan kokoinen. Devaajana kehittymisen kannalta on hienoa, että on riittävästi haasteita ja osaavia ihmisiä ympärillä (kuten kuvassa oikealla näkyvä Panu Vartiainen). Esimerkiksi käyttämäämme mikropalveluarkkitehtuuriin perehtyminen on ollut mielenkiintoista. Toisaalta Sympan kokoisessa yrityksessä asia hoituvat mutkattomasti ja kulttuuri on hyvin välitön. Yksi firman arvoista on ”have fun”, ja täytyy kyllä sanoa, että hauskaa on ollut!",
        "Jatkan vielä työn ohella opintojani Helsingin yliopistossa datatieteen maisteriohjelmassa. Erityisesti koneoppimisen kurssit ovat olleet kiinnostavia, ja opeille on varmasti käyttöä jatkossa myös töissä."
      ],
      "name": "Mikko Kotola",
      "title": "Full stack developer"
    }
  ],
  "en": [
    {
      "image": "Juha_Tauriainen.jpg",
      "companyLogo": "houston.svg",
      "text": [
        "My role at Houston concentrates on Frontend-development. We use a whole spectrum of technologies and libraries, including those taught in this course. As a consulting house we help our customers and partners to achieve better results through better quality. As well as the code, we bring the best practices of the field and help our customers to succeed.",
        "Working at Houston is awesome because of multiple reasons. The most I like that the employees are always number one. The ideas, suggestions and opinions of the staff are heard and reacted to. For example Houston gave me their full support to starting a mentorship program. We help people from different fields with programming, guide them to best practices and aim to get them to the business. This has taught both me and Houston very much. I get a huge kick out of helping others – no matter if they are customers, work mates or students."
      ],
      "name": "Juha Tauriainen",
      "title": "Senior Consultant"
    },
    {
      "image": "Tuukka_Peuraniemi.jpg",
      "companyLogo": "terveystalo.svg",
      "text": [
        "I have many years of experience on health technologies. I ended up as a software developer after a few twists and turns. I started out as a pharmasist. Then I graduated as a Master of Computer Science and proceeded to work as a development director and later as a software developer.",
        "I enjoy working at Terveystalo, because here you have a say on the technologies we use and which projects you want to take part on. Due to my role and my experience I get to take part on starting and developing different new services. Right now I develop a new mobile application, which will see the light of day among customers in the near future. ",
        "In the future I want to continue to advance in my job and to keep learning. Working in  multivendor-projects with experienced colleaques maintains and  develops my skills.",
        "I believe Terveystalo will keep offering new meaningful projects in the future."
      ],
      "name": "Tuukka Peuraniemi",
      "title": "Sovelluskehittäjä ja digitaalinen moniosaaja"
    },
    {
      "image": "Juho_Kyrola.jpg",
      "companyLogo": "elisa.svg",
      "text": [
        "I work at Elisa as a software developer and study IT at Aalto University. I am at the end of my studies, and will soon begin my thesis. I have also completed courses and worked here at the same time. I ended up at Elisa because of a recommendation from a friend, he told me, that this is a good company to work for and urged me to apply.",
        "Previously I worked for a couple other companies for roughly 1.5 years as a developer. Programming has been a hobby of mine since childhood, and I have always known computers are my thing. My first programming language was Java.",
        "I work at Elisa Automate working on an optimization platform for mobile networks. I work with the platform itself, not the optimization algorithms. Technologies I have used for projects include Python, React, Elasticsearch and Docker, and for me the best is exactly this – full stack programming. You are not a front end hero, but you get to do it all. It keeps the passion up. The projects are also meaningful for me. It’s fun that we are the pioneers of the field and not just doing our own versions of something already existing.",
        "In the beginning it was a bit difficult to get the hang of the project I work on, but bit by bit I got there. It has been really motivating, that this is something else than just creating a “normal” website.  It is easy to immerse yourself with the work alone, but it is important to keep the importance of team work in mind. Without teamwork the work proceeds slowly and you might end up doing the wrong thing. For new employees (both trainees and more experienced coders) it would be beneficial to do for example parner coding in the beginning.",
        "Beforehand I was interested to know, wether the culture in a large company would be very stuck up, but I was pleasantly surprised that my team is so agile. Advancing the work does not feel like getting blood from a stone, but is almost a walk in the park. Before starting my job I thought I would easily end up tighly siloed, but in reality I have been able to do diversely different things. You just have to ask for diverse things to do yourself! You have to take charge of your own motivation.",
        "The interview had two parts. First I met my future boss, who determined wha kind of person I am. On a different day there was a technical interview, where my competence was tested through chatting and small exercises. Thjroughout the process you could clearly see the humane side, they did not only care about how good a coder you are, but also who you are as a person. The application process did not give me the feeling of being examined, but that we were looking for a common ground, and I got a feel of who my future teammates are.",
        "The corporate culture here meets my expectations, and it is easy to arrange your job around your life. Communication also works well, things are discussed enough within the company, and I have not gotten the feeling that there is this shady “upper floor” where everything is decided. Of course you don’t always know what is being done in other teams, but that seems to be the same in every other big company.",
        "There are enough opportunities to advance and learn, and you get to use your skills. Your manager and your teams scrum master proposes different things, now I am going to React Finland event. All in all, it’s fun rather than annoying to come to work everyday."
      ],
      "name": "Juho Kyrölä",
      "title": "Software Developer"
    },
    {
      "image": "burcu_aybak.jpg",
      "companyLogo": "unity.svg",
      "text": [
        "I am working at Unity as a Full-stack Software Engineer and have ten years of experience in software development including e.g. web applications, command and control systems and communication systems.",
        "I love being in software engineering because it is a combination of intelligent problem solving and creative work. Sometimes it makes me feel like I am a superhero! Then again there are always new things and subjects to learn and you get paid to do what you enjoy with people you like - work in engineering is fun! Our industry and customers are fun (games!) and it is great to do work that helps our customers to make a living with what they love.",
        "I like working at Unity because the work allows me to work with excellent colleagues and different personalities from all over the world who are also very good at their jobs. It is a perfect place to learn new technologies and explore new areas. Unity is a perfect workplace for me in ways that I can’t explain in just a few sentences."
      ],
      "name": "Burcu Aybak",
      "title": "Software Engineer"
    },
    {
      "image": "kristiina_ronnberg.jpg",
      "companyLogo": "konecranes.svg",
      "text": [
        "In a field where continuous learning is almost vital, I have been lucky to get to work with the latest technologies and experienced colleaques. In my role at Konecranes I get to work in an international environment and develop solutions which bring the benefits of industrial internet to the everyday lives of our customers. The technology palette we use is rich, and the development methods have become even more agile – the contents covered by this course are also present in our work.",
        "My road to IT was not the most straight forwards. I studied as a Finnish teacher, but ended up, after continuing my education, shifting careers to this different world where language and  writing skills and creativity are emphazised as well. Partly due to my background I have been delighted, that at Konecrass the different backgrounds and skills of the employees are appreciated and their advancement is supported. In this kind of environment the new field and developing in it has felt natural and motivating."
      ],
      "name": "Kristiina Rönnberg",
      "title": "Software Engineer"
    },
    {
      "image": "mikko_kotola_ja_panu_vartiainen.jpg",
      "companyLogo": "sympa.svg",
      "text": [
        "I completed the Full Stack course amongst the first in the beginning of 2018. The course was a very important part of my bachelor’s degree in Computer Science. I got to know modern tools and the logic of single page web apps. More broadly it was important for me to get routine into functional and asynchronous programming. The course did not always feel easy: sometimes fiddling with some especially challenging bits was a real headache. But you learn by doing!",
        "I got my degree in the summer of 2018, and started as a full stack developer at Symppa in the fall. Symppa offers their customers HR systems as SaaS. Our company has over 100 employees in five countries, and we are growing fast. For me changing jobs ment also changing careers, as my first degree is in political science ans I used to work in university administration. Enthusiasm about coding sucked me in to a new degree and a new career.",
        "The size of Symppa appealed to me. Enough challendes and being surrounded by skilled people (for example Panu Vartiainen, in the right) is good for developing as a coder. For example immersing myself in the microservice architecture has been interseting. In the other hand in a company of Symppas size things run smoothly and the culture is easygoing. One of the values of the company is “have fun”, and I must say it has been a lot of fun!.",
        "I am continuing my education with a master’s degree in Data Science in the University of Helsinki. Courses in machine learning have been especially interesting, and the knowledge will definetely be useful in my job in the future."
      ],
      "name": "Mikko Kotola",
      "title": "Full stack developer"
    }
  ]
}
