{
  "mainTitle": "Syväsukellus moderniin websovelluskehitykseen",
  "intro": "Ota haltuusi React, Redux, Node.js, MongoDB ja GraphQL! Kurssilla tutustutaan JavaScriptilla tapahtuvaan moderniin websovelluskehitykseen. Pääpaino on React-kirjaston avulla toteutettavissa single page -sovelluksissa, ja niitä tukevissa Node.js:llä toteutetuissa REST-rajapinnoissa.",
  "current": [
    "Kurssista on mahdollista saada suoritusmerkintä <a target='_blank' href='https://courses.helsinki.fi/fi/aytkt21009/124726896'>Avoimen yliopiston</a> kautta. Kurssi on suoritettavissa 10.1.2020 asti.",
    "Kurssiin liittyvää keskustelua Telegramissa, kanavalla <a target='_blank' href='https://t.me/fullstackcourse'>https://t.me/fullstackcourse</a>, tule mukaan! <ul><li>Huom: kaikki epäasialliset, halventavat ja jotain ihmisryhmää syrjivät kommentit kanavalla ovat kiellettyjä ja tälläisten kommenttien esittäjät poistetaan kanavalta.</li></ul>"
  ],
  "telegram": "Telegram on whatsappin/messengerin tyylinen keskustelufoorumisovellus, jota on mahdollista käyttää selaimella, mobiililaitteilla ja Windows/Linux/OSX-clienteillä.",
  "notice": "Huom: kaikki epäasialliset, halventavat ja jotain ihmisryhmää syrjivät kommentit kanavalla ovat kiellettyjä ja tälläisten kommenttien esittäjät poistetaan kanavalta.",
  "licence": [
    "Kurssimateriaalin on tehnyt <a href='https://github.com/mluukkai'>Matti Luukkainen</a>. Lukuisat <a href='https://github.com/fullstack-hy2019/misc/blob/master/contributors.md'>henkilöt</a> ovat parantaneet materiaalin laatua kirjoitus- ja asiavirhekorjauksin. Voit osallistua  kurssimateriaalin parantamiseen myös itse. <br/><br/> Sivuston designin on suunnitellut ja toteuttanut <a target='_blank' href='https://www.houston-inc.com/'>Houston inc</a>, joka on myös auditoinut kurssin sisällön.",
    "Tämä materiaali on lisensoitu <a href='https://creativecommons.org/licenses/by-nc-sa/3.0/'>Creative Commons BY-NC-SA 3.0</a> -lisenssillä, joten voit käyttää ja levittää sitä vapaasti, kunhan alkuperäisten tekijöiden nimiä ei poisteta. Jos teet muutoksia materiaaliin ja haluat levittää muunneltua versiota, se täytyy lisensoida samalla lisenssillä. Materiaalien käyttö kaupalliseen tarkoitukseen on ilman erillistä lupaa kielletty."
  ],
  "university": "Helsingin yliopisto on Suomen vanhin ja suurin tiedekorkeakoulu, yhteensä 40 000 henkilön kansainvälinen tiedeyhteisö. Tieteen voimalla yliopisto on rakentanut yhteiskuntaa, sivistystä ja hyvinvointia jo vuodesta 1640.",
  "houston": "Suomalainen Houston Inc. on vuonna 2003 perustettu ketterä softatalo. Suunnittelemme ja toteutamme asiakkaillemme räätälöityjä digitaalisia palveluita liiketoiminnan tarpeisiin.",
  "contacts": [
    "Full stack -websovelluskehitys 2019",
    "matti.luukkainen@helsinki.fi"
  ],
  "licenced": "Materiaali on lisensoitu Creative Commons BY-NC-SA 3.0 -lisenssillä."
}
