import React from 'react';

import ChallengePage from '../components/ChallengePage';

const Challenge = () => {
  return (
    <ChallengePage
      lang="ar"
      title="تحدي فول ستاك | فول ستاك أوبن"
      seoDescription="تتعاون كلا جامعة هلسنكي وشركة Houston Inc معًا لتحدي الشركات والمطورين على حد سواء ليتعلموا ويطوروا مهاراتهم في مجال تطوير الويب المتكامل (full-stack development). تم إنشاء هذه الدورة من قبل المبرمجين لصالح المبرمجين لتناسب كلًا من المبتدئين والمتمرسين في المجال"
      aboutContent={[
        'يحتاج العالم لمطوري البرمجيات احتياجًا ماسًا. نسعى أن نساهم في تدريب جيل المبرمجين القادم؛ أحد الطرق التي نوفرها هي التسجيل في دورة Full Stack MOOC.',
        'تتعاون كلا جامعة هلسنكي وشركة  Houston Inc مع بعضهم البعض لتحدي الشركات والمطورين على حد سواء ليتعلموا ويطوروا مهاراتهم بروح تطوير صادقة في مجال تطوير الويب المتكامل. بعض شركائنا هم Terveystalo Oyj ،Konecranes Oyj ،K-ryhmä ،Elisa Oyj.',
        'هدفنا هو تشجيعك على التعلم. نقدم دورة Full Stack مكتملة ومصممة بعناية لتسهيل دخولك في هذا المجال وتعلم أحدث التقنيات العملية والإنتاجية. الدورة مجانية بالكامل، ويمكنك المشاركة فيها من أي مكان وفي أي وقت، متى يحلو لك.',
        'تم تأليف هذه الدورة من قبل المبرمجين لصالح المبرمجين حيث أنها تناسب المبتدئين والمتمرسين على حد سواء. المتطلب الوحيد لأخذ هذه الدورة هو الإلمام الجيد بأساسيات البرمجة.',
      ]}
      joinContent={[
        'بقبولكم التحدي، ستقومون بتشجيع وتمكين أعضاء مجتمعكم المهني ليكتسبوا مهارات جديدة. ستكون دورتنا والتي هي إلكترونية بالكامل تكملة رائعة إلى جانب برامج التدريب والتطوير الخاصة بكم. كما ستكون محتوى دراسي ممتاز للتعلم الذاتي ضمن برامج التدريب الأخرى الخاصة بكم التي تعرضوها على موظفيكم.',
        'بمشاركتك التحدي، سترسل رسالة خاطبة للعالم الخارجي عن خبرة شركتك التقنية إذ سيساعد هذا على بناء صورة إيجابية لموظفيك وتوسيع رؤيتك لمحترفي مجال البرمجيات.',
        'المشاركة بالتحدي مجانية. سنكون مفتخرين بوضع شعارات الشركات التي ستبلي دعوتنا وتقبل التحدي على موقعنا هذا.',
      ]}
    />
  );
};

export default Challenge;
